CarRent/src/CarRentWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="CarRentWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/CarRent/src/CarRentWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/CarRent/src/CarRentWSDL" xmlns:ns="http://xml.netbeans.org/schema/CarRentSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/CarRent/src/CarRentWSDL">
            <xsd:import namespace="http://xml.netbeans.org/schema/CarRentSchema" schemaLocation="CarRentSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="ReservationRequest">
        <part name="ReservationInput" element="ns:myInput"/>
    </message>
    <message name="ReservationResponse">
        <part name="ReservationOutput" element="ns:myOutput"/>
    </message>
    <message name="ReservationFault">
        <part name="ReservationFault" element="ns:myFault"/>
    </message>
    <portType name="CarRentWSDLPortType">
        <operation name="Reservation">
            <input name="input1" message="tns:ReservationRequest"/>
            <output name="output1" message="tns:ReservationResponse"/>
            <fault name="fault1" message="tns:ReservationFault"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="CarRentWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="CarRentWSDLPortTypeRole" portType="tns:CarRentWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
