CarRentCA/test/TestCase3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:car="http://xml.netbeans.org/schema/CarRentSchema">
  <soapenv:Body>
    <car:myInput>
      <car:idCustomer>2</car:idCustomer>
      <car:idVehicle>2</car:idVehicle>
      <car:idStore>2</car:idStore>
      <car:report>Prueba2Bpel</car:report>
      <car:startDateS>2024-09-21</car:startDateS>
      <car:finishDateS>2024-09-28</car:finishDateS>
    </car:myInput>
  </soapenv:Body>
</soapenv:Envelope>